/*
havINI.hpp

ABOUT

Havoc's single-file INI library for C++.

TODO

- Code refactoring.
- Add more error handling code.
- Improve unicode support.

REVISION HISTORY

v0.3 (2024-04-22) - Fixed a small bug which would result into undefined behavior and did some performance optimization.
v0.2 (2024-01-14) - Exclude havUtils functions from the one definition rule.
v0.1 (2024-01-10) - First release.

LICENSE

MIT License

Copyright (c) 2024 René Nicolaus

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#ifndef HAVINI_HPP
#define HAVINI_HPP

// Add -D_FILE_OFFSET_BITS=64 to CFLAGS for large file support.
// Optionally, you can use #define HAVINI_CASE_SENSITIVE before including the header file to enforce case sensitivity for section names and keys in key/value pairs.

#ifdef _WIN32
#ifdef _MBCS
#error "_MBCS is defined, but only Unicode is supported"
#endif
#undef _UNICODE
#define _UNICODE
#undef UNICODE
#define UNICODE

#undef NOMINMAX
#define NOMINMAX

#undef STRICT
#define STRICT

#ifndef _WIN32_WINNT
#define _WIN32_WINNT _WIN32_WINNT_WINXP
#endif
#ifdef _MSC_VER
#include <SDKDDKVer.h>
#endif

#undef WIN32_LEAN_AND_MEAN
#define WIN32_LEAN_AND_MEAN
#include <windows.h>
#endif

#include <algorithm>
#include <cstdio>
#include <cstdint>
#include <cuchar>
#include <cstring>
#include <codecvt>
#include <iostream>
#include <iomanip>
#include <iterator>
#include <stdexcept>
#include <string>
#include <string_view>
#include <sstream>
#include <locale>
#include <type_traits>
#include <optional>
#include <memory>
#include <vector>

static_assert(sizeof(signed char) == 1, "expected char to be 1 byte");
static_assert(sizeof(unsigned char) == 1, "expected unsigned char to be 1 byte");
static_assert(sizeof(signed char) == 1, "expected int8 to be 1 byte");
static_assert(sizeof(unsigned char) == 1, "expected uint8 to be 1 byte");
static_assert(sizeof(signed short int) == 2, "expected int16 to be 2 bytes");
static_assert(sizeof(unsigned short int) == 2, "expected uint16 to be 2 bytes");
static_assert(sizeof(signed int) == 4, "expected int32 to be 4 bytes");
static_assert(sizeof(unsigned int) == 4, "expected uint32 to be 4 bytes");
static_assert(sizeof(signed long long) == 8, "expected int64 to be 8 bytes");
static_assert(sizeof(unsigned long long) == 8, "expected uint64 to be 8 bytes");

namespace havINI {
    enum class havINIBOMType : std::uint8_t
    {
        None,
        UTF8,
        UTF16LE,
        UTF16BE,
        UTF32LE,
        UTF32BE
    };

    enum class havINIDataType : std::uint8_t
    {
        Empty,
        Comment,
        Value,
        Array
    };

    enum class havINIPosition : std::uint8_t
    {
        Start,
        End,
        Above,
        Below
    };

    namespace havUtils
    {
        constexpr bool StartsWith(std::string_view sv, std::string_view prefix)
        {
            return sv.size() >= prefix.size() && sv.compare(0, prefix.size(), prefix) == 0;
        }

        constexpr bool EndsWith(std::string_view sv, std::string_view suffix)
        {
            return sv.size() >= suffix.size() && sv.compare(sv.size() - suffix.size(), suffix.size(), suffix) == 0;
        }

